features.org
#+Title: Desired Features of my-course Tool

* Create New Courses

1) prompt user for information about new courses
   + term name
   + courses to teach
     - sections of each course
   + location of csv roster for each course
2) create directories and files for each course

#+BEGIN_SRC sh
/home/brian/ownCloud/teaching/16-fall
|- info
|  |- first-day.org
|  |- homework-labels.pdf
|  |- roster.csv
|  |- email.csv
|  |- waitlist.csv
|- exams
|- gradebook
|- scratch
#+END_SRC

3) create course classes and save info to config file
4) save defaults to config file


